vim编辑文件有两个模式。
 1. 正常模式：所有输入都是命令，也叫命令模式（命令区分大小写，必须是英文半角字符）。
 2. 插入模式：直接编辑文件内容，不能输入命令，也叫编辑模式。左下角有`-- INSTER --` 字样。

终端中 `vim 文件名` 打开文件。如果目录内没有这个文件，就新建并打开文件。
打开文件后默认是正常模式，输入`i`进入插入模式。在插入模式中按`esc`键返回正常模式。

- ## 保存关闭
`:wq` 保存并关闭文档
`:w` 是保存文档，后面加文件名就表示另存为新文件。
`:q!` 不保存修改强制关闭文档

- ## 移动光标 
`h` `j` `k` `l` 对应方向键(`←` `↓` `↑` `→`)。也可直接使用方向键，每次移动一个字符，前面加数字表示移动相应长度，如`4h`光标左移4个字符
`w` 移动到下一个单词词首
`e` 移动到下一个单词词尾
`b` 移动到当前单词或上一个单词词首
`0` 数字０，光标移动到本行末尾
`$` 光标移动到本行开头
`H` 光标移动到屏幕最上一行，可以在前面加上数字，如：`3H` 光标移动到第三行
`L` 光标移动到屏幕最后一行，可以在前面加上数字，如：`2L` 光标移动到倒数第二行
`M`  光标移动到屏幕中间
`gg` 或 `[[` 光标移动到文档第一行
`G` 或 `]]` 光标移动到文档最后一行，可在`G`前加数字，如`4G`光标移动到文档第4行
`ctrl+f` 往下翻页
`ctrl+b` 往上翻页

- ## 搜索查找
`/` 斜杠后面输入要搜索的字符，回车，从光标所在位置往后搜索并跳转下一条。`n`或者回车键继续查找下一条, `N`反向查找上一条
`?` 问号后面输入要搜索的字符，回车，从光标所在位置往前搜索并跳转上一条。`n`继续查找上一条，`N`反向查找下一条

- ## 基本编辑
  - 删除
`x` 删除光标所在位置的字符，可在前面加数字，如`3x`删除光标右侧3个字符
`X` 删除光标左侧的字符，可在前面加数字，如`4X`删除光标左侧4个字符
`dd` 删除光标所在的行
`dw` 删除光标右侧所有字符
`db` 删除光标左侧所有字符
以上删除内容都将保存在剪贴板
`J `删除换行符（合并本行和下一行）

  - 复制粘贴
`yy`复制光标所在行到剪贴板
`yw` 复制光标右侧所有字符到剪贴板
`yb` 复制光标左侧所有字符到剪贴板
`p` 如果剪贴板为整行内容，则粘贴至光标所在行的下方，如果剪贴板为非整行，则粘贴至光标所在字符的后面

 -  撤销和重做
`u` 撤销
`Ctrl+r` 重做

- ## 帮助
`:help`进入帮助模式，可查看更多命令用法
`:q` 退出帮助模式，回到正常模式
